CSI API ETABS v1
cSapModel.DesignCompositeBeam Property
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
cDesignCompositeBeam DesignCompositeBeam { get; }
ReadOnly Property DesignCompositeBeam As cDesignCompositeBeam
	Get
Dim instance As cSapModel
Dim value As cDesignCompositeBeam
value = instance.DesignCompositeBeam
property cDesignCompositeBeam^ DesignCompositeBeam {
	cDesignCompositeBeam^ get ();
}
abstract DesignCompositeBeam : cDesignCompositeBeam with get
Property Value
Type: cDesignCompositeBeam
See Also
Reference
cSapModel Interface
ETABSv1 Namespace